//ELIPRT   JOB (ACCT),'PRINT VSAM',CLASS=A,MSGCLASS=X,
//             NOTIFY=&SYSUID
//PRINT   EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//INDD    DD DSN=ELIEL.EMUNAH.ARQ.CLIENTE.KSDS,DISP=SHR
//SYSIN    DD *
  PRINT INFILE(INDD) COUNT(5) CHAR
/*
