//CRTGEN   JOB CLASS=A,MSGCLASS=X,NOTIFY=&SYSUID
//STEP1    EXEC PGM=IEFBR14
//EXTRATO  DD DSN=ELIEL.EMUNAH.ARQ.EXTRATO.GDG(+1),
//            DISP=(NEW,CATLG,DELETE),
//            SPACE=(TRK,(3,1)),
//            DCB=(DSORG=PS,RECFM=FB,LRECL=200,BLKSIZE=6000)
