//DEFGDG   JOB CLASS=A,MSGCLASS=X,NOTIFY=&SYSUID
//STEP1    EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  DEFINE GENERATIONDATAGROUP -
    (NAME(ELIEL.EMUNAH.ARQ.EXTRATO.GDG) -
     LIMIT(30) -
     NOEMPTY -
     SCRATCH)
/*
