//DELG001  JOB CLASS=A,MSGCLASS=X,NOTIFY=&SYSUID
//STEP1    EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  DELETE ELIEL.EMUNAH.ARQ.EXTRATO.GDG.G0001V00
  DELETE ELIEL.EMUNAH.ARQ.EXTRATO.GDG.G0002V00
  DELETE ELIEL.EMUNAH.ARQ.EXTRATO.GDG.G0003V00
  DELETE ELIEL.EMUNAH.ARQ.EXTRATO.GDG
