//EBALSTG  JOB ,'EMUNAH ALOC STAGE',CLASS=A,MSGCLASS=X,MSGLEVEL=(1,1)
//ALOC     EXEC PGM=IEFBR14
//STAGE    DD DSN=ELIEL.EMUNAH.STAGE.ENTRADA.SEQ,
//             DISP=(NEW,CATLG,DELETE),
//             UNIT=SYSDA,SPACE=(TRK,(5,2)),
//             DCB=(RECFM=FB,LRECL=120,BLKSIZE=0)
//SYSPRINT DD SYSOUT=*
