//* ============================================================
//* ARQUIVO      : EBDEFGDG.jcl
//* CAMINHO LOCAL: jcl/deploy/EBDEFGDG.jcl
//* HOST / PDS   : ELIEL.EMUNAH.DEV.JCL(EBDEFGDG)
//*
//* FINALIDADE:
//* Definir as 7 bases GDG (Generation Data Groups) do
//* laboratorio. Executar UMA UNICA VEZ apos EBALLOC.
//* ============================================================
//EBDEFGDG JOB ,'EMUNAH DEFGDG',CLASS=A,MSGCLASS=X,MSGLEVEL=(1,1)
//*
//* === STEP DEFGDG: DEFINIR 7 BASES GDG ========================
//*
//DEFGDG   EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  DELETE 'ELIEL.EMUNAH.ARQ.EXTRATO.GDG' GDG FORCE
  SET MAXCC = 0
  DEFINE GENERATIONDATAGROUP -
    (NAME('ELIEL.EMUNAH.ARQ.EXTRATO.GDG') -
     LIMIT(2) -
     NOEMPTY -
     SCRATCH)

  DELETE 'ELIEL.EMUNAH.ARQ.SALDO.GDG' GDG FORCE
  SET MAXCC = 0
  DEFINE GENERATIONDATAGROUP -
    (NAME('ELIEL.EMUNAH.ARQ.SALDO.GDG') -
     LIMIT(2) -
     NOEMPTY -
     SCRATCH)

  DELETE 'ELIEL.EMUNAH.ARQ.BKP.CLIENTE.GDG' GDG FORCE
  SET MAXCC = 0
  DEFINE GENERATIONDATAGROUP -
    (NAME('ELIEL.EMUNAH.ARQ.BKP.CLIENTE.GDG') -
     LIMIT(2) -
     NOEMPTY -
     SCRATCH)

  DELETE 'ELIEL.EMUNAH.ARQ.BKP.CONTA.GDG' GDG FORCE
  SET MAXCC = 0
  DEFINE GENERATIONDATAGROUP -
    (NAME('ELIEL.EMUNAH.ARQ.BKP.CONTA.GDG') -
     LIMIT(2) -
     NOEMPTY -
     SCRATCH)

  DELETE 'ELIEL.EMUNAH.ARQ.BKP.AUDIT.GDG' GDG FORCE
  SET MAXCC = 0
  DEFINE GENERATIONDATAGROUP -
    (NAME('ELIEL.EMUNAH.ARQ.BKP.AUDIT.GDG') -
     LIMIT(2) -
     NOEMPTY -
     SCRATCH)

  DELETE 'ELIEL.EMUNAH.ARQ.BKP.REJEITOS.GDG' GDG FORCE
  SET MAXCC = 0
  DEFINE GENERATIONDATAGROUP -
    (NAME('ELIEL.EMUNAH.ARQ.BKP.REJEITOS.GDG') -
     LIMIT(2) -
     NOEMPTY -
     SCRATCH)

  DELETE 'ELIEL.EMUNAH.ARQ.BKP.REJPERM.GDG' GDG FORCE
  SET MAXCC = 0
  DEFINE GENERATIONDATAGROUP -
    (NAME('ELIEL.EMUNAH.ARQ.BKP.REJPERM.GDG') -
     LIMIT(2) -
     NOEMPTY -
     SCRATCH)
/*
//*
//* === STEP VERIFY: CONFIRMAR DEFINICAO DAS 7 BASES ============
//*
//VERIFY   EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  LISTCAT ENT('ELIEL.EMUNAH.ARQ.EXTRATO.GDG')      ALL
  LISTCAT ENT('ELIEL.EMUNAH.ARQ.SALDO.GDG')        ALL
  LISTCAT ENT('ELIEL.EMUNAH.ARQ.BKP.CLIENTE.GDG')  ALL
  LISTCAT ENT('ELIEL.EMUNAH.ARQ.BKP.CONTA.GDG')    ALL
  LISTCAT ENT('ELIEL.EMUNAH.ARQ.BKP.AUDIT.GDG')    ALL
  LISTCAT ENT('ELIEL.EMUNAH.ARQ.BKP.REJEITOS.GDG') ALL
  LISTCAT ENT('ELIEL.EMUNAH.ARQ.BKP.REJPERM.GDG')  ALL
/*
