      01  CLIENTE-REG.
           05 CLI-ID-CLIENTE         PIC 9(5).
           05 CLI-NOME               PIC X(30).
           05 CLI-CPF                PIC 9(11).
           05 CLI-DATA-NASC          PIC 9(8).
           05 CLI-STATUS             PIC X(1).
           05 CLI-DATA-CAD           PIC 9(8).
