       01  CONTA-REG.
           05 CNT-AGENCIA            PIC 9(4).
           05 CNT-NUM-CONTA          PIC 9(8).
           05 CNT-ID-CLIENTE         PIC 9(5).
           05 CNT-TIPO-CONTA         PIC X(2).
           05 CNT-STATUS             PIC X(1).
           05 CNT-SALDO-ATUAL        PIC 9(13).
           05 CNT-DATA-ABERTURA      PIC 9(8).
