//* ============================================================
//* ARQUIVO      : EBJBACKP.jcl
//* CAMINHO LOCAL: jcl/batch/EBJBACKP.jcl
//* HOST / PDS   : Z77948.EMUNAH.DEV.JCL(EBJBACKP)
//*
//* FINALIDADE:
//* Realizar o backup diario dos datasets do Emunah Bank.
//* Gera novas geracoes (+1) para as GDGs de seguranca.
//*
//* POSICAO NA CADEIA DIARIA:
//* Executado apos o fechamento (EBJEOD) ou antes do inicio.
//*
//* COMPONENTES BACKAPEADOS:
//* 1. Clientes (KSDS)     -> BKP.CLIENTE.GDG
//* 2. Contas (KSDS)       -> BKP.CONTA.GDG
//* 3. Auditoria (SEQ)     -> BKP.AUDIT.GDG
//* 4. Rejeitos (SEQ)      -> BKP.REJEITOS.GDG
//* 5. Conciliacao (SEQ)   -> BKP.CONCIL.GDG
//*
//* CODIGOS DE RETORNO:
//* RC 0 = Backup concluido com sucesso.
//* RC 8 = Erro na copia de algum dataset - verificar SYSPRINT.
//* ============================================================
//EBJBACKP JOB ,'EMUNAH BKP',CLASS=A,MSGCLASS=X,MSGLEVEL=(1,1)
//*
//* === STEP BKPCLI: BACKUP DE CLIENTES (KSDS -> GDG) ==========
//BKPCLI   EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//INFILE   DD DSN=Z77948.EMUNAH.ARQ.CLIENTE.KSDS,DISP=SHR
//OUTFILE  DD DSN=Z77948.EMUNAH.BKP.CLIENTE.GDG(+1),
//            DISP=(NEW,CATLG,DELETE),
//            UNIT=SYSDA,SPACE=(TRK,(5,5))
//SYSIN    DD *
  REPRO INFILE(INFILE) OUTFILE(OUTFILE)
/*
//*
//* === STEP BKPCNT: BACKUP DE CONTAS (KSDS -> GDG) ============
//BKPCNT   EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//INFILE   DD DSN=Z77948.EMUNAH.ARQ.CONTA.KSDS,DISP=SHR
//OUTFILE  DD DSN=Z77948.EMUNAH.BKP.CONTA.GDG(+1),
//            DISP=(NEW,CATLG,DELETE),
//            UNIT=SYSDA,SPACE=(TRK,(5,5))
//SYSIN    DD *
  REPRO INFILE(INFILE) OUTFILE(OUTFILE)
/*
//*
//* === STEP BKPAUD: BACKUP DE AUDITORIA (SEQ -> GDG) ==========
//BKPAUD   EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//INFILE   DD DSN=Z77948.EMUNAH.ARQ.AUDIT.SEQ,DISP=SHR
//OUTFILE  DD DSN=Z77948.EMUNAH.BKP.AUDIT.GDG(+1),
//            DISP=(NEW,CATLG,DELETE),
//            UNIT=SYSDA,SPACE=(TRK,(10,5))
//SYSIN    DD *
  REPRO INFILE(INFILE) OUTFILE(OUTFILE)
/*
//*
//* === STEP BKPREJ: BACKUP DE REJEITOS (SEQ -> GDG) ===========
//BKPREJ   EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//INFILE   DD DSN=Z77948.EMUNAH.ARQ.REJEITOS.SEQ,DISP=SHR
//OUTFILE  DD DSN=Z77948.EMUNAH.BKP.REJEITOS.GDG(+1),
//            DISP=(NEW,CATLG,DELETE),
//            UNIT=SYSDA,SPACE=(TRK,(5,5))
//SYSIN    DD *
  REPRO INFILE(INFILE) OUTFILE(OUTFILE)
/*
//*
//* === STEP BKPCNC: BACKUP DE CONCILIACAO (SEQ -> GDG) ========
//* Utiliza LIKE para herdar perfeitamente LRECL=132 e BLKSIZE
//BKPCNC   EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//INFILE   DD DSN=Z77948.EMUNAH.ARQ.CONCIL.SEQ,DISP=SHR
//OUTFILE  DD DSN=Z77948.EMUNAH.BKP.CONCIL.GDG(+1),
//            DISP=(NEW,CATLG,DELETE),
//            UNIT=SYSDA,SPACE=(TRK,(10,5)),
//            LIKE=Z77948.EMUNAH.ARQ.CONCIL.SEQ
//SYSIN    DD *
  REPRO INFILE(INFILE) OUTFILE(OUTFILE)
/*