//* ------------------------------------------------------------
//* ARQUIVO      : EBDEPLOY.jcl
//* FINALIDADE   : COMPILAR E LINKAR A CADEIA BATCH PRINCIPAL
//* ------------------------------------------------------------
//EBDEPLOY JOB ,'EMUNAH DEPLOY',CLASS=A,MSGCLASS=X,MSGLEVEL=(1,1)
//*
//CL01     EXEC IGYWCL
//COBOL.SYSIN   DD DSN=Z77948.EMUNAH.DEV.COBOL(EBCLLOAD),DISP=SHR
//COBOL.SYSLIB  DD DSN=Z77948.EMUNAH.DEV.COPY,DISP=SHR
//LKED.SYSLMOD  DD DSN=Z77948.EMUNAH.DEV.LOADLIB(EBCLLOAD),DISP=SHR
//LKED.SYSPRINT DD SYSOUT=*
//*
//CL02     EXEC IGYWCL,COND=(4,LT)
//COBOL.SYSIN   DD DSN=Z77948.EMUNAH.DEV.COBOL(EBVALI01),DISP=SHR
//COBOL.SYSLIB  DD DSN=Z77948.EMUNAH.DEV.COPY,DISP=SHR
//LKED.SYSLMOD  DD DSN=Z77948.EMUNAH.DEV.LOADLIB(EBVALI01),DISP=SHR
//LKED.SYSPRINT DD SYSOUT=*
//*
//CL03     EXEC IGYWCL,COND=(4,LT)
//COBOL.SYSIN   DD DSN=Z77948.EMUNAH.DEV.COBOL(EBPOST01),DISP=SHR
//COBOL.SYSLIB  DD DSN=Z77948.EMUNAH.DEV.COPY,DISP=SHR
//LKED.SYSLMOD  DD DSN=Z77948.EMUNAH.DEV.LOADLIB(EBPOST01),DISP=SHR
//LKED.SYSPRINT DD SYSOUT=*
//*
//CL04     EXEC IGYWCL,COND=(4,LT)
//COBOL.SYSIN   DD DSN=Z77948.EMUNAH.DEV.COBOL(EBACCR01),DISP=SHR
//COBOL.SYSLIB  DD DSN=Z77948.EMUNAH.DEV.COPY,DISP=SHR
//LKED.SYSLMOD  DD DSN=Z77948.EMUNAH.DEV.LOADLIB(EBACCR01),DISP=SHR
//LKED.SYSPRINT DD SYSOUT=*
//*
//CL05     EXEC IGYWCL,COND=(4,LT)
//COBOL.SYSIN   DD DSN=Z77948.EMUNAH.DEV.COBOL(EBSNAP01),DISP=SHR
//COBOL.SYSLIB  DD DSN=Z77948.EMUNAH.DEV.COPY,DISP=SHR
//LKED.SYSLMOD  DD DSN=Z77948.EMUNAH.DEV.LOADLIB(EBSNAP01),DISP=SHR
//LKED.SYSPRINT DD SYSOUT=*
//*
//CL06     EXEC IGYWCL,COND=(4,LT)
//COBOL.SYSIN   DD DSN=Z77948.EMUNAH.DEV.COBOL(EBCONC01),DISP=SHR
//COBOL.SYSLIB  DD DSN=Z77948.EMUNAH.DEV.COPY,DISP=SHR
//LKED.SYSLMOD  DD DSN=Z77948.EMUNAH.DEV.LOADLIB(EBCONC01),DISP=SHR
//LKED.SYSPRINT DD SYSOUT=*
//*
//CL07     EXEC IGYWCL,COND=(4,LT)
//COBOL.SYSIN   DD DSN=Z77948.EMUNAH.DEV.COBOL(EBREPR01),DISP=SHR
//COBOL.SYSLIB  DD DSN=Z77948.EMUNAH.DEV.COPY,DISP=SHR
//LKED.SYSLMOD  DD DSN=Z77948.EMUNAH.DEV.LOADLIB(EBREPR01),DISP=SHR
//LKED.SYSPRINT DD SYSOUT=*
//*
//CL08     EXEC IGYWCL,COND=(4,LT)
//COBOL.SYSIN   DD DSN=Z77948.EMUNAH.DEV.COBOL(EBCTL01),DISP=SHR
//COBOL.SYSLIB  DD DSN=Z77948.EMUNAH.DEV.COPY,DISP=SHR
//LKED.SYSLMOD  DD DSN=Z77948.EMUNAH.DEV.LOADLIB(EBCTL01),DISP=SHR
//LKED.SYSPRINT DD SYSOUT=*
//*
//CL09     EXEC IGYWCL,COND=(4,LT)
//COBOL.SYSIN   DD DSN=Z77948.EMUNAH.DEV.COBOL(EBPCHK01),DISP=SHR
//COBOL.SYSLIB  DD DSN=Z77948.EMUNAH.DEV.COPY,DISP=SHR
//LKED.SYSLMOD  DD DSN=Z77948.EMUNAH.DEV.LOADLIB(EBPCHK01),DISP=SHR
//LKED.SYSPRINT DD SYSOUT=*
//*
//CL10     EXEC IGYWCL,COND=(4,LT)
//COBOL.SYSIN   DD DSN=Z77948.EMUNAH.DEV.COBOL(EBJEOD01),DISP=SHR
//COBOL.SYSLIB  DD DSN=Z77948.EMUNAH.DEV.COPY,DISP=SHR
//LKED.SYSLMOD  DD DSN=Z77948.EMUNAH.DEV.LOADLIB(EBJEOD01),DISP=SHR
//LKED.SYSPRINT DD SYSOUT=*
//*
//CL11     EXEC IGYWCL,COND=(4,LT)
//COBOL.SYSIN   DD DSN=Z77948.EMUNAH.DEV.COBOL(EBEXTR01),DISP=SHR
//COBOL.SYSLIB  DD DSN=Z77948.EMUNAH.DEV.COPY,DISP=SHR
//LKED.SYSLMOD  DD DSN=Z77948.EMUNAH.DEV.LOADLIB(EBEXTR01),DISP=SHR
//LKED.SYSPRINT DD SYSOUT=*
//*
//CL12     EXEC IGYWCL,COND=(4,LT)
//COBOL.SYSIN   DD DSN=Z77948.EMUNAH.DEV.COBOL(EBCOMM01),DISP=SHR
//COBOL.SYSLIB  DD DSN=Z77948.EMUNAH.DEV.COPY,DISP=SHR
//LKED.SYSLMOD  DD DSN=Z77948.EMUNAH.DEV.LOADLIB(EBCOMM01),DISP=SHR
//LKED.SYSPRINT DD SYSOUT=*
//*
//CL13     EXEC IGYWCL,COND=(4,LT)
//COBOL.SYSIN   DD DSN=Z77948.EMUNAH.DEV.COBOL(EBSALD01),DISP=SHR
//COBOL.SYSLIB  DD DSN=Z77948.EMUNAH.DEV.COPY,DISP=SHR
//LKED.SYSLMOD  DD DSN=Z77948.EMUNAH.DEV.LOADLIB(EBSALD01),DISP=SHR
//LKED.SYSPRINT DD SYSOUT=*
