      *===============================================================*
      * COPYBOOK: CPSLD001                                            *
      * FUNCAO  : LAYOUT DE POSICAO DE SALDO                          *
      * REGISTRO: 120 BYTES                                           *
      *===============================================================*
           05 SLD-AGENCIA              PIC 9(04).
           05 SLD-NUM-CONTA            PIC 9(08).
           05 SLD-SALDO                PIC S9(11)V99.
           05 SLD-DATA                 PIC 9(08).
           05 FILLER                   PIC X(87).
